app/controllers/active_test_controller.rb

  def participate
    @current_test = ActiveTest.find(params[:id])
    if Participant.find(:all,:conditions => {:user_id => current_user.id,:active_test_id => params[:id]}).blank?
      if !Participant.new({:user_id => current_user.id, :active_test_id => params[:id]}).save
---
SELECT * FROM "active_tests" WHERE ("active_tests"."id" = 12)
SELECT * FROM "participants" WHERE ("participants"."user_id" = 3 AND "participants"."active_test_id" = '21')
INSERT INTO "participants" ("created_at", "updated_at", "active_test_id", "user_id") VALUES('2011-04-05 21:50:57.301293', '2011-04-05 21:50:57.301293', 12, 3) RETURNING "id"