app/controllers/result_controller.rb

  def show
    @types = [['Użytkownik', 1], ['Grupa', 2]]
    @groups = Group.find_all_with_user_rights(current_user.id, "name ASC")
---
SELECT * FROM "groups" WHERE ("groups"."id" IN (2,4)) ORDER BY name ASC
SELECT * FROM "users" WHERE ("users"."id" IN (3,4)) ORDER BY surname ASC

  def generate_pdf
    if params[:taken_test_id].blank?
      raise "Nie wybrano testu lub błędne ID"
    else
      @t_test = TakenTest.find_by_id(params[:taken_test_id])
---
SELECT * FROM "taken_tests" WHERE ("taken_tests"."id" = '2') LIMIT 1

  def reload_elements_tests
    case params[:ctype]
    when "1" then
      @items = User.find_all_with_user_rights(current_user.id, "surname ASC")
      render :partial => "result/elements", :locals => {:ctype => params[:ctype], :citems => @items}
    when "2" then
      @items = Group.find_all_with_user_rights(current_user.id, "name ASC")
---
SELECT * FROM "users" WHERE ("users"."id" IN (3,4)) ORDER BY surname ASC
SELECT * FROM "groups" WHERE ("groups"."id" IN (2,4)) ORDER BY name ASC

  def reload_tests
    case params[:ctype]
    when "1" then
      @items = TakenTest.find(:all).delete_if { |t_test| !t_test.user.include?(User.find(params[:element_id])) }
      render :partial => "result/tests", :locals => {:ctype => params[:ctype], :citems => @items}
    when "2" then
      @items = TakenTest.find(:all, :conditions => {:group_id => params[:element_id]}, :order => "id ASC")
---
SELECT "users".id FROM "users" INNER JOIN "taken_tests_users" ON "users".id = "taken_tests_users".user_id WHERE ("users"."id" = 2) AND ("taken_tests_users".taken_test_id = 2 ) LIMIT 1
SELECT * FROM "tests" WHERE ("tests"."id" = 2)
SELECT * FROM "taken_tests" WHERE ("taken_tests"."group_id" = E'2') ORDER BY id ASC