app/controllers/test_controller.rb

SELECT * FROM "active_tests" WHERE ("active_tests"."id" = 16)
SELECT * FROM "questions" WHERE ("questions"."test_id" = 2) ORDER BY id ASC
SELECT * FROM "tests" WHERE ("tests"."id" = 2)
---
  def next_q
    q_max = ActiveTest.find(params[:active_test_id]).test.questions.size

SELECT * FROM "active_tests" WHERE ("active_tests"."id" = 16)
SELECT * FROM "questions" WHERE ("questions"."test_id" = 2) ORDER BY id ASC
SELECT * FROM "tests" WHERE ("tests"."id" = 2)
---
  def prev_q
    q_max = ActiveTest.find(params[:active_test_id]).test.questions.size

SELECT * FROM "active_tests" WHERE ("active_tests"."id" = 17)
SELECT * FROM "questions" WHERE ("questions"."test_id" = 2) ORDER BY id ASC
SELECT * FROM "tests" WHERE ("tests"."id" = 2)
DELETE FROM "active_answers" WHERE "id" = 12
INSERT INTO "active_answers" ("question_id", "created_at", "updated_at", "user_id", "active_test_id", "answer_id") VALUES(3, '2011-04-08 02:40:46.653945', '2011-04-08 02:40:46.653945', 3, 17, 10) RETURNING "id"
---
  def mark_answer
    if !params[:answer].nil?
      params[:question_ord_id].nil? ? ( params[:question_ord_id] = 1) : nil
      question_id = ActiveTest.find(params[:active_test_id]).find_question_by_ord_id(params[:question_ord_id]).id
      ActiveAnswer.destroy_all({:user_id => current_user.id, :active_test_id => params[:active_test_id], :question_id => question_id})
      params[:answer].each do |ans_id|
        ActiveAnswer.new({:user_id => current_user.id, :active_test_id => params[:active_test_id], :answer_id => ans_id, :question_id => question_id}).save

SELECT * FROM "file_infos" WHERE ("file_infos"."test_id" = E'2' AND "file_infos"."ext" = E'video/x-flv') ORDER BY id ASC
---
  def rss_playlist
    @videos = FileInfo.find_all_by_test_id_and_ext(params[:id], "video/x-flv", :order => "id ASC")

SELECT * FROM "tests" WHERE ("tests"."id" IN (2,3)) ORDER BY name ASC
SELECT * FROM "groups" WHERE ("groups"."id" IN (2,4)) ORDER BY name ASC
SELECT * FROM "active_tests" WHERE ("active_tests"."user_id" = 2 AND "active_tests"."is_running" = 'f') ORDER BY created_at ASC
SELECT * FROM "groups" WHERE ("groups"."id" = 2) ORDER BY name ASC
SELECT * FROM "tests" WHERE ("tests"."id" = 1) ORDER BY name ASC
SELECT * FROM "users" WHERE ("users"."id" = 2) LIMIT 1
---
  def make_test
    @tests = Test.find_all_with_user_rights(current_user.id, "name ASC")
    @groups = Group.find_all_with_user_rights(current_user.id, "name ASC")
    @a_tests = ActiveTest.find(:all, :conditions => {:user_id => current_user.id, :is_running => false}, :order => "created_at ASC")

INSERT INTO "active_tests" ("created_at", "updated_at", "is_running", "group_id", "user_id", "test_id", "start_time") VALUES('2011-04-05 20:27:04.207223', '2011-04-05 20:27:04.207223', 'f', 2, 2, 2, NULL) RETURNING "id"
---
  def start_test
    @a_test = ActiveTest.new({:test_id => params[:test_id], :user_id => current_user.id, :group_id => params[:group_id]})
    self.check_errors(@a_test.save, @a_test)

SELECT * FROM "active_tests" WHERE ("active_tests"."id" = 3)
SELECT * FROM "tests" WHERE ("tests"."id" = 2)
UPDATE "active_tests" SET "start_time" = '2011-03-31 23:18:22.000000', "updated_at" = '2011-03-31 23:18:22.623056', "is_running" = 't' WHERE "id" = 3
---
  def activate_test
    @a_test = ActiveTest.find(params[:id])
    @a_test.update_attributes({:is_running => true, :start_time => DateTime.now})

DELETE FROM "active_tests" WHERE "id" = 1
SELECT * FROM "active_tests" WHERE ("active_tests"."id" = 1)
---
  def destroy_a_test
    ActiveTest.find(params[:id]).destroy

SELECT * FROM "tests" WHERE ("tests"."id" = 1)
SELECT * FROM "questions" WHERE ("questions"."test_id" = E'1') ORDER BY id ASC
---
  def edit
    @test = Test.find(params[:id])
    @questions = Question.find_all_by_test_id(params[:id], :order => "id ASC")

SELECT * FROM "question_types" LIMIT 1
INSERT INTO "questions" ("file_info_id", "created_at", "updated_at", "ord_id", "tekst", "question_type_id", "test_id") VALUES(NULL, '2011-04-05 22:57:14.511685', '2011-04-05 22:57:14.511685', NULL, E'---', 1, 2) RETURNING "id"
---
  def add_question
    @question = Question.new(:test_id => params[:id], :tekst => "---", :question_type_id => QuestionType.first.id)
    self.check_errors(@question.save, @question)

INSERT INTO "answers" ("question_id", "file_info_id", "created_at", "updated_at", "ord_id", "points", "tekst") VALUES(1, NULL, '2011-04-05 23:09:04.950385', '2011-04-05 23:09:04.950385', NULL, 0, E'---') RETURNING "id"
---
  def add_answer
    Answer.create :question_id => params[:question_id], :tekst => "---", :points => 0

DELETE FROM "questions" WHERE "id" = 4
SELECT * FROM "file_infos" WHERE ("file_infos".question_id = 4) LIMIT 1
SELECT * FROM "questions" WHERE ("questions"."id" = 1)
UPDATE "questions" SET "updated_at" = '2011-04-12 02:13:16.779202', "tekst" = 'Co to jest algorytm?' WHERE "id" = 1
INSERT INTO "file_infos" ("name", "question_id", "ext", "created_at", "updated_at", "file_content_id", "answer_id", "owner_type", "test_id") VALUES(E'question_1', 1, E'image/gif', '2011-04-09 23:05:12.208924', '2011-04-09 23:05:12.208924', NULL, NULL, E'q', 2) RETURNING "id"
---
  def change_question
    if params[:commit] == "Usuń załącznik"
      Question.find(params[:question_id]).file_info.destroy
      flash[:notice] = "Pomyślnie wykonano operację"
    end
    if params[:commit] == "Usuń pytanie"
      Question.find(params[:question_id]).destroy
      flash[:notice] = "Pomyślnie wykonano operację"
    end
    if params[:commit] == "Zapisz pytanie"
      @q = Question.find(params[:question_id])
      if self.check_errors(@q.update_attributes(params[:questions].first.last), @q)
        if !params[:attachment].nil?
          if @q.file_info.blank?
            tmp = FileInfo.create_from_upload(params)

SELECT * FROM "answers" WHERE ("answers"."id" = 1)
UPDATE "answers" SET "updated_at" = '2011-04-12 02:13:33.001749', "tekst" = 'odp 1 1', "points" = 2 WHERE "id" = 1
---
  def change_answer
    if params[:commit] == "Usuń załącznik"
      Answer.find(params[:answer_id]).file_info.destroy
      flash[:notice] = "Pomyślnie wykonano operację"
    end
    if params[:commit] == "Usuń odpowiedź"
      Answer.find(params[:answer_id]).destroy
      flash[:notice] = "Pomyślnie wykonano operację"
    end
    if params[:commit] == "Zapisz odpowiedź"
      @a = Answer.find(params[:answer_id])
      if self.check_errors(@a.update_attributes(params[:curr_answers].first.last), @a)